       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB04.
      **************************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = BRUNO LEONEL 
      * OBJETIVO = ATRIBUICAO DE NOME E SALARIO
      * IMPRIMINDO FORMATADO - USANDO VIRGULA
      * DATA = XX/XX/XXXX
      **************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOME        PIC X(20) VALUE SPACES.
       77 WRK-SALARIO     PIC 9(06)V99 VALUE ZEROS.
       77 WRK-SALARIO-MSK PIC $ZZZ.ZZ9,99 VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT  WRK-NOME FROM CONSOLE.
           ACCEPT  WRK-SALARIO FROM CONSOLE.
           DISPLAY 'NOME: ' WRK-NOME.
           MOVE    WRK-SALARIO TO WRK-SALARIO-MSK
           DISPLAY 'SALARIO: ' WRK-SALARIO-MSK.
           STOP RUN.
